{
  "type": "network",
  "version": "1.0",
  "data": "data.json",
  "logo": {
    "file": "",
    "link": "",
    "text": "Viviane Schuch"
  },
  "text": {
    "more": "We select an initial list of 170 virus that cause diseases in humans, and retrieve all PMIDs related to them using Taxonomy ID tool from NCBI. Data were downloaded in october, 2020. Pubtator Central and our own scripts were used to identify the potential relationships (edges) between chemicals and virus (nodes). We excluded all types of reviews, letters and editorials articles and selected only associations supported by two or more documents. Biological concepts were annotated using MeSH descriptors. We performed a modular analysis using the community detection algorithm implemented within Gephi software. Modules are denoted by color, and node size represents degree. Virus: 78 different species that cause disease in humans. Chemicals: 1517. Edges: 5514 associations supported by 2 or more documents. Node size represents degree. Modules are denoted by node color. Undirected graph",
    "intro": "Pubtator Central and our own scripts were used to identify the potential relationships (edges) between chemicals and pathogenic virus (nodes). We performed a modular analysis using the community detection algorithm implemented within Gephi software. Modules are denoted by color, and node size represents degree.\n",
    "title": "Virus x Chemicals Knowledge Network"
  },
  "legend": {
    "edgeLabel": "Document Association",
    "colorLabel": "Modularity",
    "nodeLabel": "Virus and Chemicals"
  },
  "features": {
    "search": true,
    "groupSelectorAttribute": false,
    "hoverBehavior": "default"
  },
  "informationPanel": {
    "groupByEdgeDirection": false,
    "imageAttribute": false
  },
  "sigma": {
    "drawingProperties": {
      "defaultEdgeType": "curve",
      "defaultHoverLabelBGColor": "#002147",
      "defaultLabelBGColor": "#ddd",
      "activeFontStyle": "bold",
      "defaultLabelColor": "#000",
      "labelThreshold": 10,
      "defaultLabelHoverColor": "#fff",
      "fontStyle": "bold",
      "hoverFontStyle": "bold",
      "defaultLabelSize": 14
    },
    "graphProperties": {
      "maxEdgeSize": 0.5,
      "minEdgeSize": 0.2,
      "minNodeSize": 1,
      "maxNodeSize": 7
    },
    "mouseProperties": {
      "maxRatio": 20,
      "minRatio": 0.75
    }
  }
}